var TradeTools = {
    tradeStates: function(strSt) {
        if (strSt.length == 1) {
            if (strSt == "S" || strSt == "Y") {
                return "交易成功"
            } else if (strSt == "I" || strSt == "K" || strSt == "N") {
                return "处理中"
            } else if (strSt == "C") {
                return "已撤单"
            } else if (strSt == "F") {
                return "交易失败"
            }
        } else if (strSt.length == 2) {
            if (strSt.indexOf("C") != -1) {
                return "已撤单"
            } else if (strSt.indexOf("F") != -1) {
                return "交易失败"
            } else if (strSt.indexOf("S") != -1 || strSt == "NY") {
                return "交易成功"
            } else {
                return "处理中"
            }
        };
        return "未知状态"
    },
    getAmt: function(subQuty, subAmt, apKind, apKind_list) {
        var subAmtTxt = "";
        if ((subAmt == undefined || subAmt == null) && (subQuty == undefined || subQuty == null)) {
            return ""
        } else if (subAmt == undefined || subAmt == null) {
            subAmtTxt = App.numberFormat(subQuty) + "份"
        } else if (subQuty == undefined || subQuty == null) {
            subAmtTxt = App.numberFormat(subAmt) + "元"
        } else {
            if (apKind_list.indexOf(apKind) > -1) {
                if (Number(subQuty) != 0) {
                    subAmtTxt = App.numberFormat(subQuty) + "份"
                } else if (Number(subAmt) != 0) {
                    subAmtTxt = App.numberFormat(subAmt) + "元"
                } else {
                    subAmtTxt = ''
                }
            } else if (Number(subAmt) != 0) {
                subAmtTxt = App.numberFormat(subAmt) + "元"
            } else if (Number(subQuty) != 0) {
                subAmtTxt = App.numberFormat(subQuty) + "份"
            } else {
                subAmtTxt = ""
            }
        };
        return subAmtTxt
    },
    tradeType: function(typeString) {
        var type = TradeTools.tradeTypeList[String(typeString)];
        if (type == undefined || type == null) {
            type = typeString
        };
        return type
    },
    getDisplayAcco: function(bankAcco) {
        return "****" + bankAcco.substr(bankAcco.length - 4, bankAcco.length)
    },
    paymentKey: {
        "XJB": "V",
        "BNK": "B"
    },
    paymentType: function(name) {
        if (TradeTools.paymentKey["XJB"] == name) {
            return "现金宝支付"
        } else if (TradeTools.paymentKey["XJB"] == name) {
            return "银行卡支付"
        } else {
            return ""
        }
    },
    findBankNm: function(bankNo) {
        var card = App.getBankName(bankNo);
        if (card == null) {
            return ""
        };
        return card.bankNm
    },
    tradeTypeList: {
        "8888": "信用卡自助还款",
        "8889": "信用卡自动还款",
        "001": "开户",
        "002": "销户",
        "003": "账户信息修改",
        "004": "账户冻结",
        "005": "账户解冻",
        "006": "挂失",
        "007": "解挂",
        "008": "增加交易账户",
        "009": "撤销交易账户",
        "020": "认购",
        "021": "预约认购",
        "022": "申购",
        "023": "预约登记",
        "024": "赎回",
        "025": "预约赎回",
        "026": "内部转托管",
        "027": "转托管转入",
        "028": "转托管转出",
        "029": "设置分红方式",
        "030": "认购结果",
        "031": "份额冻结",
        "032": "份额解冻",
        "033": "非交易过户",
        "034": "非交易过户转入",
        "035": "非交易过户转出",
        "036": "基金转换",
        "037": "基金转换转入",
        "038": "基金转换转出",
        "039": "定投申购",
        "040": "退款",
        "041": "补款",
        "042": "强行赎回",
        "043": "红利发放",
        "044": "强行调增",
        "045": "强行调减",
        "046": "跨TA转换",
        "049": "定期不定额申购",
        "052": "撤单",
        "053": "撤预约单",
        "054": "无效资金",
        "059": "新增定投计划",
        "060": "终止定投计划",
        "061": "变更定投计划",
        "062": "新增预约赎回计划",
        "063": "变更预约赎回计划",
        "064": "终止预约赎回计划",
        "065": "暂停定投计划",
        "066": "恢复定投计划",
        "090": "补办基金账户卡",
        "096": "撤销交易账户（自）",
        "097": "内部转托管",
        "098": "快速过户",
        "101": "开户",
        "102": "销户",
        "103": "账户信息修改",
        "104": "基金账户冻结",
        "105": "基金账户解冻",
        "106": "基金账户卡挂失",
        "107": "基金账户卡解挂",
        "108": "增加交易账户",
        "109": "撤销交易账户（分）",
        "120": "认购",
        "121": "预约认购",
        "122": "申购",
        "123": "预约登记",
        "124": "赎回",
        "125": "预约赎回",
        "126": "转托管转出",
        "127": "转托管转入",
        "128": "转托管转出",
        "129": "设置分红方式",
        "130": "认购确认",
        "131": "基金份额冻结",
        "132": "基金份额解冻",
        "133": "非交易过户",
        "134": "非交易过户转入",
        "135": "非交易过户转出",
        "136": "基金转换",
        "137": "基金转换转入",
        "138": "基金转换转出",
        "139": "定投申购",
        "140": "退款",
        "141": "补款",
        "142": "强制赎回",
        "143": "红利发放",
        "144": "强制调增",
        "145": "强制调减",
        "146": "配号",
        "149": "募集失败",
        "150": "基金清盘",
        "151": "基金终止",
        "152": "撤单",
        "153": "撤预约单",
        "154": "无效资金",
        "159": "定期不定额申购",
        "190": "补办基金账户卡",
        "196": "撤销交易账户（自）",
        "197": "内部转托管",
        "198": "快速过户",
        "199": "转托管转出",
        "201": "银行卡自助还款",
        "202": "现金宝自助还款",
        "203": "银行卡和现金宝自助还款",
        "211": "银行卡自动还款",
        "212": "现金宝自动还款",
        "701": "手机单笔充值",
        "702": "新增手机充值计划",
        "703": "终止手机充值计划",
        "704": "修改手机充值计划",
        "705": "暂停手机充值计划",
        "706": "恢复手机充值计划",
        "707": "手机自动充值",
        "708": "手机亲情号充值",
        "801": "开通网上交易",
        "900": "现金宝充值失败退款",
        "908": "现金宝账户开通",
        "909": "现金宝账户撤销",
        "910": "银行卡变更",
        "911": "银行卡全称修改",
        "912": "身份证15-18转换",
        "913": "密码修改",
        "915": "客户经理修改",
        "916": "委托方式修改",
        "918": "新增银行卡",
        "919": "撤销银行卡",
        "920": "现金宝认购",
        "922": "充值",
        "924": "取现",
        "925": "定期预约取现",
        "926": "单次预约取现",
        "927": "内部转托管",
        "928": "转托管转入",
        "929": "转托管转出",
        "930": "现金宝认购确认",
        "937": "货币基金迁入",
        "938": "货币基金迁出",
        "939": "自动充值",
        "940": "现金宝定期不定额申购",
        "942": "现金宝强行赎回",
        "943": "收益结转",
        "944": "强制调增",
        "945": "强制调减",
        "949": "现金宝定投申购",
        "950": "现金宝申购",
        "951": "赎回至现金宝",
        "952": "快速取现",
        "959": "新增自动充值",
        "960": "终止自动充值",
        "961": "变更自动充值",
        "962": "新增预约取现计划",
        "963": "变更预约取现计划",
        "964": "终止预约取现计划",
        "965": "暂停自动充值计划",
        "966": "恢复自动充值计划",
        "969": "保底自动充值",
        "970": "资金存入",
        "971": "资金支取",
        "972": "资金调整",
        "973": "资金清退",
        "974": "快速取现手续费",
        "975": "额度划拨",
        "998": "现金宝快速过户",
        "988": "质押借款",
        "989": "质押还款"
    }
}